app/models/user.rb

  def set_anonymous_identifier
    return if anonymous_identifier.present?

    loop do
      adjectives = ['Mysterious', 'Anonymous', 'Enigmatic', 'Hidden', 'Secret', 'Incognito']
      nouns = ['Penguin', 'Dolphin', 'Falcon', 'Tiger', 'Phoenix', 'Voyager']
      number = rand(1..999)

      self.anonymous_identifier = "#{adjectives.sample}#{nouns.sample}#{number}"
      break unless User.exists?(anonymous_identifier: anonymous_identifier)
---
SELECT 1 AS one FROM "users" WHERE "users"."anonymous_identifier" = ? LIMIT ?  [["anonymous_identifier", "mnRpA7yv"], ["LIMIT", 1]]